mibedoyag/stm32-course-mibedoyag/tallerv-project-telescopemount/Src/Proyecto/motores.c
/**
 * @file    : motores.c
 * @author  : Miguel A. Bedoya Gonzalez --> mibedoyag@unal.edu.co
 * @brief   : Implementación de la lógica de movimiento, escalado de pasos y mapeo analógico.
 * Configuración de TIM2 (Azimut), TIM3 (Altitud) y ADC1 con DMA (Joystick).
 */

#include "Proyecto/motores.h"
#include "Proyecto/interfaz.h"
#include "stm32f4xx_hal.h"
#include "Proyecto/sensores.h"
#include <math.h>
#include <stdlib.h>

/* Instancias globales de los periféricos.
 * El control absoluto del hardware recae en este módulo, no en el autogenerador del IDE.
 */
TIM_HandleTypeDef htim2; // Timer 2 - PWM Eje Azimut
TIM_HandleTypeDef htim3; // Timer 3 - PWM Eje Altitud
ADC_HandleTypeDef hadc1; // ADC 1 - Lectura del Joystick
DMA_HandleTypeDef hdma_adc1; // DMA para el ADC1

/* Buffer donde el hardware DMA depositará continuamente las lecturas del Joystick (X e Y) */
volatile uint16_t adc_dma_buffer[2] = {2048, 2048};

// NUEVO: Variables para guardar el centro físico real del joystick
static uint16_t joy_centro_x = 2048;
static uint16_t joy_centro_y = 2048;

/* Definición de Pines Físicos */
#define AZ_DIR_PORT  GPIOA
#define AZ_DIR_PIN   GPIO_PIN_4 // PA4
#define ALT_DIR_PORT GPIOA
#define ALT_DIR_PIN  GPIO_PIN_5 // PA5

/* Definición de Pines Físicos para Finales de Carrera (Compatibles Nucleo/Blackpill) */
#define LIMIT_AZ_PORT  GPIOB
#define LIMIT_AZ_PIN   GPIO_PIN_1  // PB1 - Final de Carrera Azimut (Filtro RC -> GND)
#define LIMIT_ALT_PORT GPIOB
#define LIMIT_ALT_PIN  GPIO_PIN_2  // PB2 - Final de Carrera Altitud (Filtro RC -> GND)


/* Acumuladores de error fraccional para no perder precisión por redondeo */
static float error_acumulado_az = 0.0f;
static float error_acumulado_alt = 0.0f;

/* =========================================================================
 * VARIABLES DE LA SUB-MÁQUINA DE HOMING
 * ========================================================================= */
volatile uint8_t flag_homing_ok = 0; // Inicia en 0 (Descalibrado)

typedef enum {
    HOME_IDLE = 0,
    HOME_AZ_FAST,     // Acercamiento rápido Eje Azimut
    HOME_AZ_BACKOFF,  // Retroceso para liberar el contacto
    HOME_AZ_SLOW,     // Acercamiento micrométrico Eje Azimut
    HOME_ALT_FAST,    // Acercamiento rápido Eje Altitud
    HOME_ALT_BACKOFF, // Retroceso
    HOME_ALT_SLOW,    // Acercamiento micrométrico Eje Altitud
	HOME_ALIGN_IMU,  //Alineación post finales de carrera con los angulos euler de la IMU
	HOME_WAIT_GOTO,
    HOME_DONE
} HomingState_t;

static HomingState_t estado_homing = HOME_IDLE;

/* Variables lógicas del módulo */
JoystickData_t joystick_actual;
VelocidadModo_t velocidad_actual;

/* Variables de estado interno para la cinemática */
float posicion_actual_az = 0.0f;  // Equivalente a 'preaz' del .ino
float posicion_actual_alt = 0.0f; // Equivalente a 'prealt' del .ino

volatile uint32_t pasos_restantes_az = 0;
volatile uint32_t pasos_restantes_alt = 0;

volatile uint8_t flag_goto_terminado_az = 1;
volatile uint8_t flag_goto_terminado_alt = 1;

/* Frecuencias base para los registros ARR a 16 MHz de reloj (HCLK) */
uint32_t arr_buscar  = 999;   // 1000 Hz (GoTo Rápido)
uint32_t arr_centrar = 3999;  // 250 Hz  (Joystick Normal)
uint32_t arr_guiar   = 19999; // 50 Hz   (Ajuste Fino - Seguimiento Sideral)

/* =========================================================================
 * 1. CONFIGURACIÓN DE HARDWARE
 * ========================================================================= */

/**
 * @brief Configuración de los pines GPIO para Dirección y Timers.
 */
static void Motores_GPIO_Init(void) {
    __HAL_RCC_GPIOA_CLK_ENABLE();

    GPIO_InitTypeDef GPIO_InitStruct = {0};

    // 1. Pines de Dirección (Salida Digital) -> PA4 y PA5
    GPIO_InitStruct.Pin = AZ_DIR_PIN | ALT_DIR_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    // 2. Pin PWM Azimut (TIM2_CH1) -> PA0
    GPIO_InitStruct.Pin = GPIO_PIN_0;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF1_TIM2;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    // 3. Pin PWM Altitud (TIM3_CH1) -> PA6
    GPIO_InitStruct.Pin = GPIO_PIN_6;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    // 4. Pines de los Finales de Carrera (Entradas con Pull-Up)
    __HAL_RCC_GPIOB_CLK_ENABLE();

	GPIO_InitStruct.Pin = LIMIT_AZ_PIN | LIMIT_ALT_PIN;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_PULLUP;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
}

/**
 * @brief Configuración del ADC1 en modo Scan Continuo con DMA para PA1 y PA2.
 */
static void Motores_ADC_Init(void) {
    __HAL_RCC_ADC1_CLK_ENABLE();
    __HAL_RCC_DMA2_CLK_ENABLE(); // El ADC1 en el F411 utiliza el DMA2

    GPIO_InitTypeDef GPIO_InitStruct = {0};

    // Configurar PA1 (IN1, Eje X) y PA7 (IN2, Eje Y) en modo analógico
    GPIO_InitStruct.Pin = GPIO_PIN_1 | GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* --- Configuración del DMA (Stream 0, Canal 0) --- */
    hdma_adc1.Instance = DMA2_Stream0;
    hdma_adc1.Init.Channel = DMA_CHANNEL_0;
    hdma_adc1.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma_adc1.Init.PeriphInc = DMA_PINC_DISABLE; // El registro del ADC es fijo
    hdma_adc1.Init.MemInc = DMA_MINC_ENABLE;     // Avanzar memoria para X y luego Y
    hdma_adc1.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD; // 16 bits
    hdma_adc1.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;    // 16 bits
    hdma_adc1.Init.Mode = DMA_CIRCULAR;          // Buffer circular automático
    hdma_adc1.Init.Priority = DMA_PRIORITY_HIGH;
    hdma_adc1.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    HAL_DMA_Init(&hdma_adc1);

