mibedoyag/stm32-course-mibedoyag/tallerv-project-telescopemount/Src/Proyecto/motores.c
    __HAL_LINKDMA(&hadc1, DMA_Handle, hdma_adc1);

    /* --- Configuración del ADC1 --- */
    hadc1.Instance = ADC1;
    hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
    hadc1.Init.Resolution = ADC_RESOLUTION_12B;
    hadc1.Init.ScanConvMode = ENABLE;                     // Activar lectura multicanal
    hadc1.Init.ContinuousConvMode = ENABLE;               // Nunca detenerse
    hadc1.Init.DiscontinuousConvMode = DISABLE;
    hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
    hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
    hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    hadc1.Init.NbrOfConversion = 2;                       // Leeremos Eje X y Eje Y
    hadc1.Init.DMAContinuousRequests = ENABLE;            // Conectar con el DMA activamente
    hadc1.Init.EOCSelection = ADC_EOC_SEQ_CONV;
    HAL_ADC_Init(&hadc1);

    /* --- Configurar Canales Secuenciales --- */
    ADC_ChannelConfTypeDef sConfig = {0};

    // Rango 1: Canal 1 (PA1 - Eje X)
    sConfig.Channel = ADC_CHANNEL_1;
    sConfig.Rank = 1;
    sConfig.SamplingTime = ADC_SAMPLETIME_84CYCLES;
    HAL_ADC_ConfigChannel(&hadc1, &sConfig);

    // Rango 2: Canal 7 (PA2 - Eje Y)
    sConfig.Channel = ADC_CHANNEL_7;
    sConfig.Rank = 2;
    HAL_ADC_ConfigChannel(&hadc1, &sConfig);

    // Configurar interrupción del DMA (útil si hay errores de transmisión)
    HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream0_IRQn);
}

/**
 * @brief Configuración de los Timers 2 y 3 para generar PWM a 1 MHz de base.
 */
static void Motores_TIM_Init(void) {
    __HAL_RCC_TIM2_CLK_ENABLE();
    __HAL_RCC_TIM3_CLK_ENABLE();

    TIM_OC_InitTypeDef sConfigOC = {0};

    /* --- Configuración TIM2 (Azimut) --- */
    htim2.Instance = TIM2;
    htim2.Init.Prescaler = 16 - 1;
    htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim2.Init.Period = arr_buscar;
    htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    HAL_TIM_PWM_Init(&htim2);

    sConfigOC.OCMode = TIM_OCMODE_PWM1;
    sConfigOC.Pulse = arr_buscar / 2;
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
    HAL_TIM_PWM_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_1);

    /* --- Configuración TIM3 (Altitud) --- */
    htim3.Instance = TIM3;
    htim3.Init.Prescaler = 16 - 1;
    htim3.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim3.Init.Period = arr_buscar;
    htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    HAL_TIM_PWM_Init(&htim3);

    HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_1);

    // Habilitar Interrupciones globales para contar los pasos de los motores
	HAL_NVIC_SetPriority(TIM2_IRQn, 1, 0);
	HAL_NVIC_EnableIRQ(TIM2_IRQn);
	HAL_NVIC_SetPriority(TIM3_IRQn, 1, 0);
	HAL_NVIC_EnableIRQ(TIM3_IRQn);
}

/* =========================================================================
 * 2. FUNCIONES PRIVADAS DE CONTROL
 * ========================================================================= */

/**
 * @brief Lee los dos ejes del joystick.
 * Con el DMA activo, ya no hay tiempos de espera (Polling). Solo copiamos datos.
 */
//static void Motores_LeerJoystick(void) {
//    // El hardware escribe constantemente en adc_dma_buffer de fondo.
//    joystick_actual.eje_x = adc_dma_buffer[0];
//    joystick_actual.eje_y = adc_dma_buffer[1];
//}

/* =========================================================================
 * 3. LÓGICA DEL MÓDULO (API PÚBLICA)
 * ========================================================================= */

/**
 * @brief Inicializa el hardware y pone el sistema mecánico en un estado seguro.
 */
void Motores_InitLogica(void) {
    // 1. Iniciar hardware a bajo nivel
    Motores_GPIO_Init();
    Motores_ADC_Init();
    Motores_TIM_Init();

    //Espera crítica: El BNO055 necesita 2 segundos para cargar su firmware de fusión
	HAL_Delay(2000);

    // 2. Inicialización segura del Joystick en la zona muerta
    joystick_actual.eje_x = 2048;
    joystick_actual.eje_y = 2048;
    velocidad_actual = SPEED_BUSCAR;

    // 3. Asegurar que los motores arrancan totalmente apagados
    HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1);
    HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_1);

    // 4. Iniciar la recolección asíncrona de datos del Joystick vía DMA
    HAL_ADC_Start_DMA(&hadc1, (uint32_t*)adc_dma_buffer, 2);

    // NUEVO: Autocalibración del Joystick.
	// Leemos dónde descansa físicamente el resorte y lo guardamos como el "Cero".
	HAL_Delay(100);
	joy_centro_x = adc_dma_buffer[0];
	joy_centro_y = adc_dma_buffer[1];

    // 5. Arrancar el proceso de calibración absoluta al finalizar la inicialización
    Motores_IniciarHoming();
}

/**
 * @brief Modifica el registro ARR (Auto-Reload Register) en tiempo real
 */
void Motores_SetVelocidadGlobal(VelocidadModo_t nueva_velocidad) {
    velocidad_actual = nueva_velocidad;
    uint32_t nuevo_arr = arr_buscar;

    switch(velocidad_actual) {
        case SPEED_BUSCAR:  nuevo_arr = arr_buscar;  break;
        case SPEED_CENTRAR: nuevo_arr = arr_centrar; break;
        case SPEED_GUIAR:   nuevo_arr = arr_guiar;   break;
    }

	// Actualizamos TIM2 y reiniciamos su contador a 0 para evitar el bloqueo de 32-bits
	__HAL_TIM_SET_AUTORELOAD(&htim2, nuevo_arr);
	__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, nuevo_arr / 2);
	__HAL_TIM_SET_COUNTER(&htim2, 0);

	// Actualizamos TIM3 y reiniciamos su contador a 0
	__HAL_TIM_SET_AUTORELOAD(&htim3, nuevo_arr);
	__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, nuevo_arr / 2);
	__HAL_TIM_SET_COUNTER(&htim3, 0);
}

/**
 * @brief Lógica de evaluación periódica del sistema de movimiento con suavizado ADC y velocidad global.
 */
void Motores_UpdateLogica(void) {
    // 1. PROTECCIÓN DE HOMING: Si el Homing está activo, delegar el control
    if (estado_homing != HOME_DONE) {
        Motores_UpdateHoming();
        return;
    }

    // --- EL FIX: Memoria del estado anterior ---
    static SystemState_t estado_anterior = STATE_BOOTING;

    // 2. PROTECCIÓN DE MENÚS Y ESTADOS AUTOMÁTICOS
    if (currentState != STATE_MANUAL && currentState != STATE_CALIBRACION_FINA) {
            if (estado_anterior == STATE_MANUAL || estado_anterior == STATE_CALIBRACION_FINA) {
                HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1);
                HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_1);
            }
            estado_anterior = currentState;
            return;
        }

        estado_anterior = currentState;

    // 3. LECTURA Y FILTRADO SUAVIZADO DEL JOYSTICK (Filtro Anti-Jitter)
    // Promediamos las lecturas instantáneas del DMA para evitar ruido eléctrico en los pines analógicos
    static uint16_t filtro_x = 2048;
    static uint16_t filtro_y = 2048;

    // Suavizado exponencial (90% valor anterior + 10% lectura nueva)
    filtro_x = (uint16_t)(((uint32_t)filtro_x * 9 + adc_dma_buffer[0]) / 10);
    filtro_y = (uint16_t)(((uint32_t)filtro_y * 9 + adc_dma_buffer[1]) / 10);

