mibedoyag/stm32-course-mibedoyag/tallerv-project-telescopemount/Src/Proyecto/motores.c
    joystick_actual.eje_x = filtro_x;
    joystick_actual.eje_y = filtro_y;

    /*// 4. APLICAR LA VELOCIDAD GLOBAL ACTUALIZADA POR EL BOTÓN SPEED
    // Asegura que el motor responda al perfil elegido (GUIAR, CENTRAR, BUSCAR)
    uint32_t arr_activo = arr_buscar;
    if (velocidad_actual == SPEED_GUIAR)      arr_activo = arr_guiar;
    else if (velocidad_actual == SPEED_CENTRAR) arr_activo = arr_centrar;
    else if (velocidad_actual == SPEED_BUSCAR)  arr_activo = arr_buscar;

    // Actualizamos el Timer 2 (Azimut) con la velocidad seleccionada
    __HAL_TIM_SET_AUTORELOAD(&htim2, arr_activo);
    __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, arr_activo / 2);

    // Actualizamos el Timer 3 (Altitud) con la velocidad seleccionada
    __HAL_TIM_SET_AUTORELOAD(&htim3, arr_activo);
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, arr_activo / 2);*/

    // Latches de estado para evitar llamadas redundantes a las funciones HAL
    static uint8_t az_estado = 0;  // 0 = Detenido, 1 = Izq, 2 = Der
    static uint8_t alt_estado = 0; // 0 = Detenido, 1 = Arr, 2 = Aba

    // ---------------------------------------------------------
        // EVALUACIÓN EJE X (AZIMUT - TIM2)
        // ---------------------------------------------------------
        if (joystick_actual.eje_x < (joy_centro_x - JOYSTICK_DEADZONE)) {
            if (az_estado != 1) { // Latch: Arranca una SOLA vez
                HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1);
                HAL_GPIO_WritePin(AZ_DIR_PORT, AZ_DIR_PIN, GPIO_PIN_RESET);
                HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
                az_estado = 1;
            }
        }
        else if (joystick_actual.eje_x > (joy_centro_x + JOYSTICK_DEADZONE)) {
            if (az_estado != 2) {
                HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1);
                HAL_GPIO_WritePin(AZ_DIR_PORT, AZ_DIR_PIN, GPIO_PIN_SET);
                HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
                az_estado = 2;
            }
        }
        else {
            if (az_estado != 0) { // Frena una SOLA vez
                HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1);
                az_estado = 0;
            }
        }

        // ---------------------------------------------------------
        // EVALUACIÓN EJE Y (ALTITUD - TIM3)
        // ---------------------------------------------------------
        if (joystick_actual.eje_y < (joy_centro_y - JOYSTICK_DEADZONE)) {
            if (alt_estado != 1) {
                HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_1);
                HAL_GPIO_WritePin(ALT_DIR_PORT, ALT_DIR_PIN, GPIO_PIN_RESET);
                HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
                alt_estado = 1;
            }
        }
        else if (joystick_actual.eje_y > (joy_centro_y + JOYSTICK_DEADZONE)) {
            if (alt_estado != 2) {
                HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_1);
                HAL_GPIO_WritePin(ALT_DIR_PORT, ALT_DIR_PIN, GPIO_PIN_SET);
                HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
                alt_estado = 2;
            }
        }
        else {
            if (alt_estado != 0) {
                HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_1);
                alt_estado = 0;
            }
        }
}

/**
 * @brief Algoritmo principal de movimiento GoTo (Equivalente a 'steptep' mejorado)
 * @param azimut_target  Ángulo objetivo en Azimut (0 a 360)
 * @param altitud_target Ángulo objetivo en Altitud (-90 a 90)
 */
void Motores_Apuntar(float azimut_target, float altitud_target) {

    // 1. Calcular deltas (Diferencia de ángulos)
    float delta_az = azimut_target - posicion_actual_az;
    float delta_alt = altitud_target - posicion_actual_alt;

    // 2. Optimización: Buscar el camino más corto en Azimut (Círculo de 360°)
    if (delta_az > 180.0f)  delta_az -= 360.0f;
    if (delta_az < -180.0f) delta_az += 360.0f;

    // 3. Determinar dirección de los ejes (Set/Reset de los pines DIR)
    if (delta_az >= 0) HAL_GPIO_WritePin(AZ_DIR_PORT, AZ_DIR_PIN, GPIO_PIN_SET);
    else HAL_GPIO_WritePin(AZ_DIR_PORT, AZ_DIR_PIN, GPIO_PIN_RESET);

    if (delta_alt >= 0) HAL_GPIO_WritePin(ALT_DIR_PORT, ALT_DIR_PIN, GPIO_PIN_SET);
    else HAL_GPIO_WritePin(ALT_DIR_PORT, ALT_DIR_PIN, GPIO_PIN_RESET);

    // 4. Convertir grados a número de pasos absolutos y cargar los contadores
    pasos_restantes_az = (uint32_t)(fabsf(delta_az) * PULSOS_POR_GRADO_AZIMUT);
    pasos_restantes_alt = (uint32_t)(fabsf(delta_alt) * PULSOS_POR_GRADO_ALTITUD);

    // 5. Actualizar la memoria del telescopio para el próximo viaje
    posicion_actual_az = azimut_target;
    posicion_actual_alt = altitud_target;

    // 6. Arrancar los Timers en modo INTERRUPCIÓN (No bloqueante)
    if (pasos_restantes_az > 0) {
        flag_goto_terminado_az = 0; // Bajamos la bandera
        HAL_TIM_PWM_Start_IT(&htim2, TIM_CHANNEL_1);
    }

    if (pasos_restantes_alt > 0) {
        flag_goto_terminado_alt = 0; // Bajamos la bandera
        HAL_TIM_PWM_Start_IT(&htim3, TIM_CHANNEL_1);
    }
}

/**
 * @brief Detiene los motores inmediatamente en caso de emergencia o cancelación
 */
void Motores_DetenerGoTo(void) {
    HAL_TIM_PWM_Stop_IT(&htim2, TIM_CHANNEL_1);
    HAL_TIM_PWM_Stop_IT(&htim3, TIM_CHANNEL_1);
    pasos_restantes_az = 0;
    pasos_restantes_alt = 0;
    flag_goto_terminado_az = 1;
    flag_goto_terminado_alt = 1;
}


/* Variables globales para control de tiempo y estado del Homing */
static uint32_t temporizador_homing = 0;
static uint32_t tiempo_inicio_homing = 0; // Para el timeout de los 2 minutos de la brújula

/**
 * @brief Prepara las variables y arranca la calibración del eje Altitud.
 * El eje Azimut ya no usa interruptor físico.
 */
void Motores_IniciarHoming(void) {
	flag_homing_ok = 0;
	estado_homing = HOME_ALT_FAST; // Arrancamos directo con la altura
	temporizador_homing = HAL_GetTick();
	tiempo_inicio_homing = HAL_GetTick(); // Iniciamos conteo de los 2 minutos

	// Apagamos azimut por completo
	HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1);

	// Arrancamos Altitud hacia el switch
	HAL_GPIO_WritePin(ALT_DIR_PORT, ALT_DIR_PIN, GPIO_PIN_RESET);
	__HAL_TIM_SET_AUTORELOAD(&htim3, arr_centrar);
	__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, arr_centrar / 2);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
}

/**
 * @brief Sub-máquina de estados no bloqueante para el Homing Híbrido (Solo Altitud + Brújula Oportunista).
 */
void Motores_UpdateHoming(void) {
	if (estado_homing == HOME_IDLE || estado_homing == HOME_DONE)
		return;

	uint8_t limit_alt = HAL_GPIO_ReadPin(LIMIT_ALT_PORT, LIMIT_ALT_PIN);

	switch (estado_homing) {

	/* --- SECUENCIA EJE ALTITUD (Único switch físico) --- */
	case HOME_ALT_FAST:
		if (limit_alt == GPIO_PIN_RESET
				&& (HAL_GetTick() - temporizador_homing > 200)) {
			HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_1);
			HAL_GPIO_WritePin(ALT_DIR_PORT, ALT_DIR_PIN, GPIO_PIN_SET);
			HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
			temporizador_homing = HAL_GetTick();
			estado_homing = HOME_ALT_BACKOFF;
		}
		break;

	case HOME_ALT_BACKOFF:
		if (limit_alt == GPIO_PIN_SET
				&& (HAL_GetTick() - temporizador_homing > 200)) {
			HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_1);
			HAL_GPIO_WritePin(ALT_DIR_PORT, ALT_DIR_PIN, GPIO_PIN_RESET);

			__HAL_TIM_SET_AUTORELOAD(&htim3, arr_guiar);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, arr_guiar / 2);
			HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);

