mibedoyag/stm32-course-mibedoyag/tallerv-project-telescopemount/Src/Proyecto/motores.c
			temporizador_homing = HAL_GetTick();
			estado_homing = HOME_ALT_SLOW;
		}
		break;

	case HOME_ALT_SLOW:
		if (limit_alt == GPIO_PIN_RESET
				&& (HAL_GetTick() - temporizador_homing > 200)) {
			HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_1);
			HAL_Delay(300); // Estabilización mecánica

			// Capturamos la altura actual reportada por la IMU
			posicion_actual_alt = imu_actual.inclinacion_y;

			// Pasamos al estado de espera de Azimut / Brújula Oportunista
			estado_homing = HOME_ALIGN_IMU;
		}
		break;

		/* --- AZIMUT OPORTUNISTA + TIMEOUT DE 2 MINUTOS --- */
	case HOME_ALIGN_IMU: {
	            uint32_t tiempo_transcurrido = HAL_GetTick() - tiempo_inicio_homing;
	            uint8_t condicion_mag = (imu_actual.estado_calibracion == 3);
	            uint8_t timeout_cumplido = (tiempo_transcurrido > 30000); // 2 minutos = 120,000 ms

	            if (condicion_mag || timeout_cumplido) {

	                // 1. Guardamos la posición actual como memoria estática
	                if (condicion_mag) {
	                    posicion_actual_az = imu_actual.orientacion_z;
	                } else {
	                    posicion_actual_az = 0.0f; // Timeout superado
	                }
	                posicion_actual_alt = imu_actual.inclinacion_y;

	                // 2. Pasamos a sala de espera ANTES de disparar
	                estado_homing = HOME_WAIT_GOTO;

	                // 3. DISPARO ÚNICO Y CORREGIDO: Viajar al cero absoluto (0.0, 0.0)
	                Motores_SetVelocidadGlobal(SPEED_CENTRAR);
	                Motores_Apuntar(0.0f, 0.0f); // ¡Ahora sí viaja al cero!
	            }
	            break;
	        }

	case HOME_WAIT_GOTO:
		// Esperamos de forma pasiva a que el hardware de interrupciones de los Timers
		// (HAL_TIM_PWM_PulseFinishedCallback) baje las banderas de llegada.
		if (flag_goto_terminado_az && flag_goto_terminado_alt) {
			posicion_actual_az = 0.0f;
			posicion_actual_alt = 0.0f; // Cero absoluto del horizonte

			Motores_SetVelocidadGlobal(SPEED_BUSCAR);
			flag_homing_ok = 1; // ¡Liberamos la FSM principal al Menú!
			estado_homing = HOME_DONE;
		}
		break;

	case HOME_DONE:
		// Vacío, el control ya pasó a la función Motores_UpdateLogica
		break;

	default:
		break;
	}
}


/**
 * @brief Ejecuta el movimiento milimétrico compensando la rotación de la Tierra.
 */
void Motores_PasoSideral(float az_nuevo, float alt_nuevo) {
    float delta_az = az_nuevo - posicion_actual_az;
    float delta_alt = alt_nuevo - posicion_actual_alt;

    // Ruta más corta para Azimut
    if (delta_az > 180.0f) delta_az -= 360.0f;
    if (delta_az < -180.0f) delta_az += 360.0f;

    // Calcular micropasos teóricos (con decimales)
    float pasos_teoricos_az = delta_az * PULSOS_POR_GRADO_AZIMUT;
    float pasos_teoricos_alt = delta_alt * PULSOS_POR_GRADO_ALTITUD;

    // Sumar al acumulador histórico
    error_acumulado_az += pasos_teoricos_az;
    error_acumulado_alt += pasos_teoricos_alt;

    // Extraer la parte entera que SÍ se puede mover físicamente
    int32_t pasos_a_dar_az = (int32_t)error_acumulado_az;
    int32_t pasos_a_dar_alt = (int32_t)error_acumulado_alt;

    // Restar del acumulador los pasos que vamos a dar, conservando los decimales puros
    error_acumulado_az -= (float)pasos_a_dar_az;
    error_acumulado_alt -= (float)pasos_a_dar_alt;

    // Setear Direcciones
    if (pasos_a_dar_az > 0) HAL_GPIO_WritePin(AZ_DIR_PORT, AZ_DIR_PIN, GPIO_PIN_SET);
    else if (pasos_a_dar_az < 0) HAL_GPIO_WritePin(AZ_DIR_PORT, AZ_DIR_PIN, GPIO_PIN_RESET);

    if (pasos_a_dar_alt > 0) HAL_GPIO_WritePin(ALT_DIR_PORT, ALT_DIR_PIN, GPIO_PIN_SET);
    else if (pasos_a_dar_alt < 0) HAL_GPIO_WritePin(ALT_DIR_PORT, ALT_DIR_PIN, GPIO_PIN_RESET);

    // Sincronizar memoria del telescopio
    posicion_actual_az = az_nuevo;
    posicion_actual_alt = alt_nuevo;

    // Forzar la velocidad súper lenta para que el motor no vibre (Tracking)
    Motores_SetVelocidadGlobal(SPEED_GUIAR);

    // Inyectar los pulsos a las variables volátiles de la interrupción IT
    pasos_restantes_az += labs(pasos_a_dar_az);
    pasos_restantes_alt += labs(pasos_a_dar_alt);

    // Disparar Timers sin bloquear el microcontrolador
    if (pasos_restantes_az > 0) {
        flag_goto_terminado_az = 0;
        HAL_TIM_PWM_Start_IT(&htim2, TIM_CHANNEL_1);
    }
    if (pasos_restantes_alt > 0) {
        flag_goto_terminado_alt = 0;
        HAL_TIM_PWM_Start_IT(&htim3, TIM_CHANNEL_1);
    }
}

/* =========================================================================
 * CALLBACKS DE INTERRUPCIÓN (HAL)
 * ========================================================================= */
/**
 * @brief Se ejecuta cada vez que el Timer PWM termina un pulso.
 * @note  Esta lógica DEBE ir aquí para precisión micrométrica de hardware.
 */
void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef *htim) {

    if (htim->Instance == TIM2) { // Pulso del motor de Azimut
        if (pasos_restantes_az > 0) {
            pasos_restantes_az--;
            if (pasos_restantes_az == 0) {
                // Se acabó el viaje de este eje: Frenamos el hardware inmediatamente
                HAL_TIM_PWM_Stop_IT(&htim2, TIM_CHANNEL_1);
                // Levantamos la bandera para que la FSM tome decisiones
                flag_goto_terminado_az = 1;
            }
        }
    }

    else if (htim->Instance == TIM3) { // Pulso del motor de Altitud
        if (pasos_restantes_alt > 0) {
            pasos_restantes_alt--;
            if (pasos_restantes_alt == 0) {
                HAL_TIM_PWM_Stop_IT(&htim3, TIM_CHANNEL_1);
                flag_goto_terminado_alt = 1;
            }
        }
    }
}
